# This is a sample Python script.

# Press ⌃R to execute it or replace it with your code.
# Press Double ⇧ to search everywhere for classes, files, tool windows, actions, and settings.
from scripts.logger import setup_logger

logger = setup_logger()


def print_hi(name):
    # Use a breakpoint in the code line below to debug your script.
    print(f'Hi, {name}')  # Press ⌘F8 to toggle the breakpoint.
    # 列表 a
    a = {'*机床': '*工序类型', '11#印机空开': '印刷', '11#印机空模': '冲模', '11#印机印开(压)': '印刷', '11#印机印模': '印刷', '11#印机印模喷码': '印刷', '11号印机': '印刷', '11号印机印开喷码': '印刷', '12#印机印模': '印刷', '12号印机': '印刷', '12号印机空开压': '印刷', '18号印机': '印刷', '1号印机': '印刷', '2#印机印刷上光油': '印刷', '2号印机': '印刷', '3号印机': '印刷', '4#印机空开（压）': '印刷', '5号印机': '印刷', '6#印机空开(压)': '印刷', '6#印机印开(压)': '印刷', '7#印机空模': '冲模', '6号印机': '印刷', '7号印机': '印刷', '9#印机空开': '印刷', '9#印机印开(压)': '印刷', '9#印机印模': '印刷', '9号印机': '印刷', 'UV油': '表面处理', '半自动卡盒': '冲模', '半自动卡盒-胶印': '冲模', '穿绳': '包装', '穿绳-胶印': '包装', '穿提手-胶印': '包装', '打孔': '包装', '点数打包-胶印': '包装', '钉箱-胶印': '装钉', '鼎龙': '印刷', '光膜': '表面处理', '光油': '表面处理', '光油-胶印': '表面处理', '胶印': '印刷', '全自动卡盒': '冲模', '全自动卡盒-胶印': '冲模', '切纸': '切纸', '入库-胶印': '包装', '手工': '包装', '手提扣': '包装', '刷油': '表面处理', '手工撕边': '包装', '贴面': '切纸', '贴窗-胶印': '贴窗', '无纺布提手-胶印': '包装', '压线': '分纸开槽', '哑膜': '表面处理', '哑油': '表面处理', '预印面标': '预印', '粘箱-胶印': '粘合', '2.5M瓦楞机': '瓦楞机', '2.5报': '瓦楞机', '2.2M瓦楞机': '瓦楞机', '2#印机普印': '印刷', '1.8M瓦楞机3线': '瓦楞机', '1.8M瓦楞机2线': '瓦楞机', '2#印机空开（压）': '印刷', '1.8M单瓦瓦楞机': '瓦楞机', '2#印机印开（压）': '印刷', '3#印机空开（压）': '印刷', '3#印机空模': '印刷', '3#印机普印': '印刷', '3#印机印开（压）': '印刷', '4号印机': '印刷', '8号印机': '印刷', '3#印机印模': '印刷', '4#印机空模': '冲模', '4#印机普印': '印刷', '1.8M瓦楞机1线': '瓦楞机', '2.8M瓦楞机': '瓦楞机', '4#印机印开（压）': '印刷', '外协纸板': '瓦楞机', '4#印机印模': '印刷', '备料纸板': '瓦楞机', '5#印机空开（压）': '印刷', '5#印机普印': '印刷', '5#印机印开（压）': '印刷', '5#印机印模': '印刷', '6#印机空模': '印刷', '6#印机普印': '印刷', '6#印机印模': '印刷', '7#印机空开（压）': '印刷', '7#印机普印': '印刷', '7#印机印开（压）': '印刷', '8#印机普印': '印刷', '1.8M瓦楞机': '瓦楞机', '半自动平模': '冲模', '卡盒圆模撕边': '冲模', '全自动平模': '冲模', '手动平模': '冲模', '圆模': '冲模', '粘合': '粘合', '全自动粘箱': '粘合', '半自动粘箱': '粘合', '粘钉一体机粘箱': '粘合', '装钉': '装钉', '粘钉一体机钉箱': '装钉', '全自动钉箱': '装钉', '手工粘箱': '粘合', '半自动钉箱': '装钉', '手工钉箱': '装钉', '双拼半自动钉箱': '装钉', '分纸': '分纸开槽', '分纸（压线）': '分纸开槽', '碰线': '分纸开槽', '自动碰线': '分纸开槽', '纸板碰线': '分纸开槽', '喷码': '分纸开槽', '喷码碰线': '分纸开槽', '点数打包': '包装', '穿提手': '包装', '成套装箱': '包装', '成箱打包': '包装', '撕边打包': '包装', '手工格挡': '包装', '贴内贴': '包装', '外协加工': '包装', '碰线打包': '包装', '开槽': '分纸开槽', '印刷后点数打包': '包装', '覆膜': '覆膜', '入库': '包装', '手工整形': '包装', '贴标签': '包装', '贴胶带': '包装', '手工刷油': '表面处理', '8#印机印模': '印刷', '8#印机空模': '印刷', '8#印机空开(压)': '印刷', '8#印机印开(压)': '印刷', '7#印机印模': '印刷', '圆模撕边': '冲模', '外协加工（覆膜）': '覆膜', '预印': '预印', '预印上光': '预印', '印刷': '印刷', '丝网印刷': '印刷', '其它': '包装', '6#印机印刷上光油': '印刷', '8#印机印刷上光油': '印刷', '4#印机印刷上光油': '印刷', '3#印机印刷上光油': '印刷', None: None}
    if '*机床' in a:
        print(a['*机床'])
    else:
        print('e')


# Press the green button in the gutter to run the script.
if __name__ == '__main__':
    print_hi('PyCharm')

# See PyCharm help at https://www.jetbrains.com/help/pycharm/
